Tekla Open API Reference for Tekla Structures 2025
RadialGrid Constructor
 Creates a new radial grid instance. Overrides the default creation parameters by forcing the angular coordinates to be "0.0 6*15.0"
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RadialGrid()
Public Sub New
See Also
Reference
RadialGrid Class
Tekla.Structures.Model Namespace